САБ/Documents/CW_ДоходыПоГрузоперевозке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>CW_ДоходыПоГрузоперевозке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйСчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокКонтейнеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособЗачетаАвансовОЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВводОстатковБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВводОстатковОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособЗачетаАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорректируемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

САБ/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

САБ/Documents/CW_ДоходыПоГрузоперевозке/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура саб_НовыйНомерПослеНаСервере()
	
	Если Объект.Дата = Дата(1,1,1) Тогда
		ДатаДокумента = ТекущаяДата();
	Иначе
		ДатаДокумента = Объект.Дата;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслуг.Номер КАК Номер,
		|	РеализацияТоваровУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата > &НачалоГода
		|	И НЕ РеализацияТоваровУслуг.Ссылка В (&СписокИсключений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ТекущаяДата()));
	СписокИсключений = Новый Массив;
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"c66281ae-f2b4-11f0-a3ed-ac1f6becb367"));//5748
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"07f90cf3-63cf-11f1-a3f2-ac1f6becb367"));//7490
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"d9eec2d1-63d3-11f1-a3f2-ac1f6becb367"));//7491
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"78bb2af9-63dc-11f1-a3f2-ac1f6becb367"));//7492
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"ee1b1604-63df-11f1-a3f2-ac1f6becb367"));//7493
	
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"f12ff18d-760a-11f1-a3f4-ac1f6becb367"));//8937
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"03d94d49-760b-11f1-a3f4-ac1f6becb367"));//8938
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"ad92629c-760c-11f1-a3f4-ac1f6becb367"));//8939
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"21871944-76a7-11f1-a3f4-ac1f6becb367"));//8940
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"62a01a1e-76bc-11f1-a3f4-ac1f6becb367"));//8941
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"ba50c4e9-9a11-11f1-a3f9-ac1f6becb367"));//1369
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"8b77a6a2-9a2f-11f1-a3f9-ac1f6becb367"));//1370
	СписокИсключений.Добавить(XMLЗначение(Тип("ДокументСсылка.РеализацияТоваровУслуг"),"9657bc8a-9aaf-11f1-a3f9-ac1f6becb367"));//011369

	
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Объект.НомерАкта = "0000-0001";
		Объект.ДатаАкта = ДатаДокумента;
		
		Объект.НомерСчетаФактуры = "0000-0001";
		Объект.ДатаСчетаФактуры = ДатаДокумента;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ПоследнийНомер = "";
		Пока Выборка.Следующий() Цикл
			ПоследнийНомер = Выборка.Номер;
		КонецЦикла;
		//Сообщить(ПоследнийНомер);
		ЧислоСтрокой = ПолучитьСтрокуТолькоЦифры(ПоследнийНомер);
		
		НовыйНомерСтрокой = "";
		Если Не ПустаяСтрока(ЧислоСтрокой) Тогда
			Результат = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЧислоСтрокой);
			Если  Результат = 5748 Тогда
				НовыйНомер = Результат + 2;	
			Иначе
				НовыйНомер = Результат + 1;
			КонецЕсли;
			//Сообщить(НовыйНомер);
			СтрНовыйНомер = Формат(НовыйНомер,"ЧГ=0");
			Если СтрДлина(СтрНовыйНомер) = 1 Тогда
				НовыйНомерСтрокой = "0000-000" + СтрНовыйНомер;
			ИначеЕсли СтрДлина(СтрНовыйНомер) = 2 Тогда
				НовыйНомерСтрокой = "0000-00" + СтрНовыйНомер;
			ИначеЕсли СтрДлина(СтрНовыйНомер) = 3 Тогда
				НовыйНомерСтрокой = "0000-0" + СтрНовыйНомер;
			ИначеЕсли СтрДлина(СтрНовыйНомер) = 4 Тогда
				НовыйНомерСтрокой = "0000-" + СтрНовыйНомер;
			ИначеЕсли СтрДлина(СтрНовыйНомер) = 5 Тогда
				НовыйНомерСтрокой = "000" + Лев(СтрНовыйНомер,1) + "-" + Прав(СтрНовыйНомер,4);
			ИначеЕсли СтрДлина(СтрНовыйНомер) = 6 Тогда
				НовыйНомерСтрокой = "00" +  Лев(СтрНовыйНомер,2) + "-" + Прав(СтрНовыйНомер,4);
			ИначеЕсли СтрДлина(СтрНовыйНомер) = 7 Тогда
				НовыйНомерСтрокой = "0" +   Лев(СтрНовыйНомер,3) + "-" + Прав(СтрНовыйНомер,4);
			ИначеЕсли СтрДлина(СтрНовыйНомер) = 8 Тогда
				НовыйНомерСтрокой =         Лев(СтрНовыйНомер,4) + "-" + Прав(СтрНовыйНомер,4);
	        КонецЕсли;
		КонецЕсли;
	    Объект.НомерАкта = НовыйНомерСтрокой;
		Объект.ДатаАкта = ДатаДокумента;
		
		Объект.НомерСчетаФактуры = НовыйНомерСтрокой;
		Объект.ДатаСчетаФактуры = ДатаДокумента;
	КонецЕсли;
	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтрокуТолькоЦифры(ВходнаяСтрока) 
	
	Результат = ВходнаяСтрока;   
	
	ИндексЭлемента = 1;  
	ДоступныеСимволы = "0123456789";
	
	Пока ИндексЭлемента <= СтрДлина(Результат) Цикл
		ПроверяемыйСимвол = Сред(Результат, ИндексЭлемента, 1);		
		
		Если СтрНайти(ДоступныеСимволы, ПроверяемыйСимвол) = 0 Тогда
			Результат = СтрЗаменить(Результат, ПроверяемыйСимвол, "");
			Продолжить;
		КонецЕсли;  		
		
		ИндексЭлемента = ИндексЭлемента + 1;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура саб_НовыйНомерПосле(Команда) 
	Если ПустаяСтрока(Объект.НомерАкта) Тогда
		саб_НовыйНомерПослеНаСервере();
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Номер уже заполнен");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура саб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Услуги.Количество() > 0 Тогда
		Для Каждого Стр Из Объект.Услуги Цикл
			Если Не ЗначениеЗаполнено(Стр.ПорядокОтражения) Тогда
				Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
				Стр.Количество = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	Элементы.ПервичныеДокументыУстановитьНомерАкта.Видимость =Ложь;
	Элементы.ПервичныеДокументыУстановитьНомерСчетФактуры.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура саб_УслугиПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные; 
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ПорядокОтражения) Тогда		
		ТекущиеДанные.Количество = 1;		
		ПорядокОтражения = _ДС().ПД.ОсновнойПорядокОтраженияДоходов;
		Если ПорядокОтражения.Пустая() Тогда
			ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга");
		КонецЕсли; 
		ТекущиеДанные.ПорядокОтражения = ПорядокОтражения;		
	КонецЕсли; 	

КонецПроцедуры
